## Plan Result





<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_project_iam_binding.dns_collector_bucket_get
  * google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer
  * google_project_iam_binding.dns_collector_dns_reader
  * google_service_account.sa_gke_kyma_integration



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_project_iam_binding.dns_collector_bucket_get will be created
  + resource "google_project_iam_binding" "dns_collector_bucket_get" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "projects/sap-kyma-prow/roles/BucketGet"
    }

  # google_project_iam_binding.dns_collector_container_analysis_occurrences_viewer will be created
  + resource "google_project_iam_binding" "dns_collector_container_analysis_occurrences_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/containeranalysis.occurrences.viewer"
    }

  # google_project_iam_binding.dns_collector_dns_reader will be created
  + resource "google_project_iam_binding" "dns_collector_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "sap-kyma-prow"
      + role    = "roles/dns.reader"
    }

  # google_service_account.sa_gke_kyma_integration will be created
  + resource "google_service_account" "sa_gke_kyma_integration" {
      + account_id   = "sa-gke-kyma-integration"
      + description  = "Service account is used by Prow to integrate with GKE."
      + disabled     = false
      + display_name = "sa-gke-kyma-integration"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Warnings :warning:

```hcl
Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account.trusted_workload_terraform_executor,
  on terraform-executor.tf line 42, in resource "kubernetes_service_account" "trusted_workload_terraform_executor":
  42: resource "kubernetes_service_account" "trusted_workload_terraform_executor" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty

(and one more similar warning elsewhere)

```






<!-- github-comment: {"Command":"plan","PRNumber":8213,"Program":"tfcmt","SHA1":"5f60db3de229745fc591c7aa5afbeea8e6a4de01","Vars":{}} -->